app/views/users/edit.html.erb

SELECT  "user_infos".* FROM "user_infos" WHERE "user_infos"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
<% userinfo = UserInfo.find_by(user_id: @user.id) %>