app/views/users/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE (user_id = 1)
SELECT COUNT(*) FROM "reviews" WHERE (user_id = 1)
---
<h3>Welcome, <%= @user.email %></h3>
<% if !Review.user_review(current_user).empty? %>