app/views/books/show.html.erb

  <% #binding.pry %>
  <% if ( (current_user.reviews.select {|review| review["book_id"] == @book.id}).empty? ) %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 10]]