app/controllers/books_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 10]]
---
  def show
    @isReviewed = !(current_user.reviews.select {|review| review["book_id"] == @book.id}).empty?

INSERT INTO "books" ("title", "author", "year", "fiction") VALUES (?, ?, ?, ?)  [["title", "Atlas Shrugged"], ["author", "Ayn Rand"], ["year", 1992], ["fiction", true]]
---
  def create
    @book = Book.new(params.require(:book).permit(:title, :author, :year, :fiction))
    if @book.save

UPDATE "books" SET "title" = ? WHERE "books"."id" = ?  [["title", "Angels & Demons"], ["id", 1]]
---
  def update
    @book.assign_attributes(params.require(:book).permit(:title, :author, :year, :fiction))
    if @book.valid?
      @book.update(params.require(:book).permit(:title, :author, :year, :year, :fiction))

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
---
  def destroy
    if !@book.nil?
      @book.destroy

SELECT "books".* FROM "books"
---
  def list
    @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def detail
    #binding.pry
    @book = Book.find_by(id: params[:id])