app/controllers/reviews_controller.rb

  def index
    @reviews = Review.all
---
SELECT  "reviews".* FROM "reviews" ORDER BY "reviews"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def show
    @review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def edit
    @review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def new
    @book = Book.find(params[:book_id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @review = Review.new(summary: params[:review][:summary], rating: params[:review][:rating], body: params[:review][:rating], book_id: params[:book_id], user_id: current_user.id)
    @book = Book.find(params[:book_id])
    if @review.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("summary", "body", "rating", "user_id", "book_id") VALUES (?, ?, ?, ?, ?)  [["summary", "Amazing"], ["body", "5"], ["rating", 5], ["user_id", 1], ["book_id", 1]]