app/controllers/reviews_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    #binding.pry
    @book = Book.find(params[:book_id])