app/controllers/users_controller.rb

  def show
    if @user.admin?
      @books = Book.all
      @users = User.all
---
SELECT "books".* FROM "books"
SELECT "users".* FROM "users"