app/controllers/users_controller.rb

  def updateinfo
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def finish_signup
    # authorize! :update, @user
    #binding.pry
    @user = User.find(params[:id])
    if request.patch? && params[:user] #&& params[:user][:email]
      if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "confirmation_token" = ?, "confirmation_sent_at" = ?, "unconfirmed_email" = ?, "updated_at" = ? WHERE "users"."id" = ?

  def destroy
    # authorize! :delete, @user
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]